SET NAMES 'utf8';
DROP DATABASE IF EXISTS haokelai;
CREATE DATABASE haokelai CHARSET=UTF8;
USE haokelai;

CREATE TABLE kf_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO kf_dish(did,img_sm,img_lg,name,price,material,detail) VALUES
(   null,
    'sm01.jpg',
    'lg01.jpg',
    '【蟹蟹你偷吃】',
    258,
    '建议2-4人食 含5套餐具  约13×13cm  约480克  ',
    '手工打发而成的进口鲜奶油，口感绵密，精致细腻，这份雪白让你有如获至宝的幸福感！新鲜的水果，与蛋糕的精心配比，酸甜清爽，回味无穷 '
),
(   null,
    'sm02.jpg',
    'lg02.jpg',
    '【雪域牛乳芝士蛋糕】',
    198,
    '建议2-4人食 含5套餐具  约13×13cm  约480克',
    '无盐黄油，白巧克力，芝士，淡奶油，手工打发而成的进口鲜奶油，口感绵密，精致细腻，这份雪白让你有如获至宝的幸福感！新鲜的水果，与蛋糕的精心配比，酸甜清爽，回味无穷'
),
(   null,
    'sm03.jpg',
    'lg03.jpg',
    '【芒果熔岩星球蛋糕】',
    318,
    '卡福洛芒果泥、稀奶油、芒果',
    '工打发而成的进口鲜奶油，口感绵密，精致细腻，这份雪白让你有如获至宝的幸福感！新鲜的水果，与蛋糕的精心配比，酸甜清爽，回味无穷'
),
(   null,
    'sm04.jpg',
    'lg04.jpg',
    '【哈!蜜瓜蛋糕】',
    318,
    '黑巧克力、蜜瓜味力娇酒、稀奶油、无盐黄油、白巧克力',
    '建议2-4人食 含5套餐具  约13×13cm  约480克'
),
(   null,
    'sm05.jpg',
    'lg05.jpg',
    '【芒果钻石雪域双拼蛋糕】',
    298,
    '奶油芝士、无盐黄油、起泡葡萄酒',
    '建议5-8人食 含10套餐具  约17×17cm  约950克'
),
(   null,
    'sm06.jpg',
    'lg06.jpg',
    '【草莓拿破仑蛋糕】',
    458,
    '新鲜草莓、幼砂糖、黄油、淡奶油',
    '建议10-12人食 含15套餐具  约22×22cm  约1500克'
),
(   null,
    'sm07.jpg',
    'lg07.jpg',
    '【莓果绵绵蛋糕 】',
    124,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm08.jpg',
    'lg08.jpg',
    '【罗马假日】',
    128,
    '新鲜芒果、淡奶油',
    '蛋糕很美味，蛋糕底是用曲奇饼一样的托盘，中间是细滑的蛋糕，上边的芒果是新鲜果，吃起来清甜不腻，下边的饼干很香，牛油味刚刚好，女儿争着要吃蛋糕底的曲奇。我订的送达时间也很准时。配套的小盘子和小叉叉也算精致，不愧米其林品质。很满意。'
),
(   null,
    'sm09.jpg',
    'lg09.jpg',
    '【冰岛奇缘蛋糕 】',
    127,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm10.jpg',
    'lg10.jpg',
    '【情思绵绵蛋糕 】',
    154,
    '新鲜杨梅、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm11.jpg',
    'lg11.jpg',
    '【曾经拥有蛋糕 】',
    125,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm12.jpg',
    'lg12.jpg',
    '【往事蹉跎蛋糕 】',
    131,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm13.jpg',
    'lg13.jpg',
    '【爱恋之都蛋糕 】',
    136,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm14.jpg',
    'lg14.jpg',
    '【天宁之别蛋糕 】',
    142,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm15.jpg',
    'lg15.jpg',
    '【莓果绵绵蛋糕 】',
    155,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm16.jpg',
    'lg16.jpg',
    '【莓果绵绵蛋糕 】',
    193,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm17.jpg',
    'lg17.jpg',
    '【相遇一方蛋糕 】',
    154,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm18.jpg',
    'lg18.jpg',
    '【莓果绵绵蛋糕 】',
    152,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm19.jpg',
    'lg19.jpg',
    '【情丝缠绵蛋糕 】',
    136,
    '新鲜桃子、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm20.jpg',
    'lg20.jpg',
    '【明日耀辉蛋糕 】',
    172,
    '新鲜草莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm21.jpg',
    'lg21.jpg',
    '【长河落日蛋糕 】',
    418,
    '新鲜丁梅、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm22.jpg',
    'lg22.jpg',
    '【思语帘帘蛋糕 】',
    147,
    '新鲜葡萄、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm23.jpg',
    'lg23.jpg',
    '【莓果绵绵蛋糕 】',
    162,
    '新鲜桔汁、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
),
(   null,
    'sm24.jpg',
    'lg24.jpg',
    '【相遇彼岸蛋糕 】',
    184,
    '新鲜蓝莓、淡奶油',
    '颗颗鲜红草莓散发诱人浓郁果香，携手爽滑细腻的鲜奶油于如浪波纹中舞出一曲甜蜜华尔兹，软绵香甜的香草戚风蛋糕，包裹纯酥脆糖和醇厚黄油，在草莓粒粒脆的星星点缀下，绽放专属少女心得纯真浪漫'
);

SELECT * FROM kf_dish;

CREATE TABLE kf_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,
    phone VARCHAR(16),
    user_name VARCHAR(16),
    sex INT,    /*1:男  2:女*/
    order_time LONG,
    addr VARCHAR(256),
    did INT
);
INSERT INTO kf_order(oid, phone,user_name,sex,order_time,addr,did) VALUES
(NULL,'13501234567','婷婷',2,1445154859209,'大钟寺中鼎B座',3),
(NULL,'13501234567','婷婷',2,1445254959209,'大钟寺中鼎B座',2),
(NULL,'13501234567','婷婷',2,1445354959209,'大钟寺中鼎B座',5);

SELECT * FROM kf_order;